grevaillot/svd_tools/headers/STM32H7B3x/nvic.h
/** @defgroup nvic_ipr6 IPR6 Interrupt Priority Register
@{*/


#define NVIC_IPR6_IPR_N3_SHIFT		24
#define NVIC_IPR6_IPR_N3_MASK		0xff
/** @defgroup nvic_ipr6_ipr_n3 IPRN3 IPR_N3
@{*/
/**@}*/


#define NVIC_IPR6_IPR_N2_SHIFT		16
#define NVIC_IPR6_IPR_N2_MASK		0xff
/** @defgroup nvic_ipr6_ipr_n2 IPRN2 IPR_N2
@{*/
/**@}*/


#define NVIC_IPR6_IPR_N1_SHIFT		8
#define NVIC_IPR6_IPR_N1_MASK		0xff
/** @defgroup nvic_ipr6_ipr_n1 IPRN1 IPR_N1
@{*/
/**@}*/


#define NVIC_IPR6_IPR_N0_SHIFT		0
#define NVIC_IPR6_IPR_N0_MASK		0xff
/** @defgroup nvic_ipr6_ipr_n0 IPRN0 IPR_N0
@{*/
/**@}*/


/**@}*/

/** @defgroup nvic_ipr7 IPR7 Interrupt Priority Register
@{*/


#define NVIC_IPR7_IPR_N3_SHIFT		24
#define NVIC_IPR7_IPR_N3_MASK		0xff
/** @defgroup nvic_ipr7_ipr_n3 IPRN3 IPR_N3
@{*/
/**@}*/


#define NVIC_IPR7_IPR_N2_SHIFT		16
#define NVIC_IPR7_IPR_N2_MASK		0xff
/** @defgroup nvic_ipr7_ipr_n2 IPRN2 IPR_N2
@{*/
/**@}*/


#define NVIC_IPR7_IPR_N1_SHIFT		8
#define NVIC_IPR7_IPR_N1_MASK		0xff
/** @defgroup nvic_ipr7_ipr_n1 IPRN1 IPR_N1
@{*/
/**@}*/


#define NVIC_IPR7_IPR_N0_SHIFT		0
#define NVIC_IPR7_IPR_N0_MASK		0xff
/** @defgroup nvic_ipr7_ipr_n0 IPRN0 IPR_N0
@{*/
/**@}*/


/**@}*/

/** @defgroup nvic_ipr8 IPR8 Interrupt Priority Register
@{*/


#define NVIC_IPR8_IPR_N3_SHIFT		24
#define NVIC_IPR8_IPR_N3_MASK		0xff
/** @defgroup nvic_ipr8_ipr_n3 IPRN3 IPR_N3
@{*/
/**@}*/


#define NVIC_IPR8_IPR_N2_SHIFT		16
#define NVIC_IPR8_IPR_N2_MASK		0xff
/** @defgroup nvic_ipr8_ipr_n2 IPRN2 IPR_N2
@{*/
/**@}*/


#define NVIC_IPR8_IPR_N1_SHIFT		8
#define NVIC_IPR8_IPR_N1_MASK		0xff
/** @defgroup nvic_ipr8_ipr_n1 IPRN1 IPR_N1
@{*/
/**@}*/


#define NVIC_IPR8_IPR_N0_SHIFT		0
#define NVIC_IPR8_IPR_N0_MASK		0xff
/** @defgroup nvic_ipr8_ipr_n0 IPRN0 IPR_N0
@{*/
/**@}*/


/**@}*/

/** @defgroup nvic_ipr9 IPR9 Interrupt Priority Register
@{*/


#define NVIC_IPR9_IPR_N3_SHIFT		24
#define NVIC_IPR9_IPR_N3_MASK		0xff
/** @defgroup nvic_ipr9_ipr_n3 IPRN3 IPR_N3
@{*/
/**@}*/


#define NVIC_IPR9_IPR_N2_SHIFT		16
#define NVIC_IPR9_IPR_N2_MASK		0xff
/** @defgroup nvic_ipr9_ipr_n2 IPRN2 IPR_N2
@{*/
/**@}*/


#define NVIC_IPR9_IPR_N1_SHIFT		8
#define NVIC_IPR9_IPR_N1_MASK		0xff
/** @defgroup nvic_ipr9_ipr_n1 IPRN1 IPR_N1
@{*/
/**@}*/


#define NVIC_IPR9_IPR_N0_SHIFT		0
#define NVIC_IPR9_IPR_N0_MASK		0xff
/** @defgroup nvic_ipr9_ipr_n0 IPRN0 IPR_N0
@{*/
/**@}*/


/**@}*/

/** @defgroup nvic_ipr10 IPR10 Interrupt Priority Register
@{*/


#define NVIC_IPR10_IPR_N3_SHIFT		24
#define NVIC_IPR10_IPR_N3_MASK		0xff
/** @defgroup nvic_ipr10_ipr_n3 IPRN3 IPR_N3
@{*/
/**@}*/


#define NVIC_IPR10_IPR_N2_SHIFT		16
#define NVIC_IPR10_IPR_N2_MASK		0xff
/** @defgroup nvic_ipr10_ipr_n2 IPRN2 IPR_N2
@{*/
/**@}*/


#define NVIC_IPR10_IPR_N1_SHIFT		8
#define NVIC_IPR10_IPR_N1_MASK		0xff
/** @defgroup nvic_ipr10_ipr_n1 IPRN1 IPR_N1
@{*/
/**@}*/


#define NVIC_IPR10_IPR_N0_SHIFT		0
#define NVIC_IPR10_IPR_N0_MASK		0xff
/** @defgroup nvic_ipr10_ipr_n0 IPRN0 IPR_N0
@{*/
/**@}*/


/**@}*/

/** @defgroup nvic_ipr11 IPR11 Interrupt Priority Register
@{*/


#define NVIC_IPR11_IPR_N3_SHIFT		24
#define NVIC_IPR11_IPR_N3_MASK		0xff
/** @defgroup nvic_ipr11_ipr_n3 IPRN3 IPR_N3
@{*/
/**@}*/


#define NVIC_IPR11_IPR_N2_SHIFT		16
#define NVIC_IPR11_IPR_N2_MASK		0xff
/** @defgroup nvic_ipr11_ipr_n2 IPRN2 IPR_N2
@{*/
/**@}*/


#define NVIC_IPR11_IPR_N1_SHIFT		8
#define NVIC_IPR11_IPR_N1_MASK		0xff
/** @defgroup nvic_ipr11_ipr_n1 IPRN1 IPR_N1
@{*/
/**@}*/


#define NVIC_IPR11_IPR_N0_SHIFT		0
#define NVIC_IPR11_IPR_N0_MASK		0xff
/** @defgroup nvic_ipr11_ipr_n0 IPRN0 IPR_N0
@{*/
/**@}*/


/**@}*/

/** @defgroup nvic_ipr12 IPR12 Interrupt Priority Register
@{*/


#define NVIC_IPR12_IPR_N3_SHIFT		24
#define NVIC_IPR12_IPR_N3_MASK		0xff
/** @defgroup nvic_ipr12_ipr_n3 IPRN3 IPR_N3
@{*/
/**@}*/


#define NVIC_IPR12_IPR_N2_SHIFT		16
#define NVIC_IPR12_IPR_N2_MASK		0xff
/** @defgroup nvic_ipr12_ipr_n2 IPRN2 IPR_N2
@{*/
/**@}*/


#define NVIC_IPR12_IPR_N1_SHIFT		8
#define NVIC_IPR12_IPR_N1_MASK		0xff
/** @defgroup nvic_ipr12_ipr_n1 IPRN1 IPR_N1
@{*/
/**@}*/


#define NVIC_IPR12_IPR_N0_SHIFT		0
#define NVIC_IPR12_IPR_N0_MASK		0xff
/** @defgroup nvic_ipr12_ipr_n0 IPRN0 IPR_N0
@{*/
/**@}*/


/**@}*/

/** @defgroup nvic_ipr13 IPR13 Interrupt Priority Register
@{*/


#define NVIC_IPR13_IPR_N3_SHIFT		24
#define NVIC_IPR13_IPR_N3_MASK		0xff
/** @defgroup nvic_ipr13_ipr_n3 IPRN3 IPR_N3
@{*/
/**@}*/


#define NVIC_IPR13_IPR_N2_SHIFT		16
#define NVIC_IPR13_IPR_N2_MASK		0xff
/** @defgroup nvic_ipr13_ipr_n2 IPRN2 IPR_N2
@{*/
/**@}*/


#define NVIC_IPR13_IPR_N1_SHIFT		8
#define NVIC_IPR13_IPR_N1_MASK		0xff
/** @defgroup nvic_ipr13_ipr_n1 IPRN1 IPR_N1
@{*/
/**@}*/


#define NVIC_IPR13_IPR_N0_SHIFT		0
#define NVIC_IPR13_IPR_N0_MASK		0xff
/** @defgroup nvic_ipr13_ipr_n0 IPRN0 IPR_N0
@{*/
/**@}*/


/**@}*/

/** @defgroup nvic_ipr14 IPR14 Interrupt Priority Register
@{*/


#define NVIC_IPR14_IPR_N3_SHIFT		24
#define NVIC_IPR14_IPR_N3_MASK		0xff
/** @defgroup nvic_ipr14_ipr_n3 IPRN3 IPR_N3
@{*/
/**@}*/


#define NVIC_IPR14_IPR_N2_SHIFT		16
#define NVIC_IPR14_IPR_N2_MASK		0xff
/** @defgroup nvic_ipr14_ipr_n2 IPRN2 IPR_N2
@{*/
/**@}*/


#define NVIC_IPR14_IPR_N1_SHIFT		8
#define NVIC_IPR14_IPR_N1_MASK		0xff
/** @defgroup nvic_ipr14_ipr_n1 IPRN1 IPR_N1
@{*/
/**@}*/


#define NVIC_IPR14_IPR_N0_SHIFT		0
#define NVIC_IPR14_IPR_N0_MASK		0xff
/** @defgroup nvic_ipr14_ipr_n0 IPRN0 IPR_N0
@{*/
/**@}*/


/**@}*/

/** @defgroup nvic_ipr15 IPR15 Interrupt Priority Register
@{*/


#define NVIC_IPR15_IPR_N3_SHIFT		24
#define NVIC_IPR15_IPR_N3_MASK		0xff
/** @defgroup nvic_ipr15_ipr_n3 IPRN3 IPR_N3
@{*/
/**@}*/


#define NVIC_IPR15_IPR_N2_SHIFT		16
#define NVIC_IPR15_IPR_N2_MASK		0xff
/** @defgroup nvic_ipr15_ipr_n2 IPRN2 IPR_N2
@{*/
/**@}*/


#define NVIC_IPR15_IPR_N1_SHIFT		8
#define NVIC_IPR15_IPR_N1_MASK		0xff
/** @defgroup nvic_ipr15_ipr_n1 IPRN1 IPR_N1
@{*/
/**@}*/


#define NVIC_IPR15_IPR_N0_SHIFT		0
#define NVIC_IPR15_IPR_N0_MASK		0xff
/** @defgroup nvic_ipr15_ipr_n0 IPRN0 IPR_N0
@{*/
/**@}*/


/**@}*/

/** @defgroup nvic_ipr16 IPR16 Interrupt Priority Register
@{*/


#define NVIC_IPR16_IPR_N3_SHIFT		24
#define NVIC_IPR16_IPR_N3_MASK		0xff
/** @defgroup nvic_ipr16_ipr_n3 IPRN3 IPR_N3
@{*/
/**@}*/


