grevaillot/svd_tools/headers/STM32H7B3x/nvic.h
#define NVIC_IPR16_IPR_N2_SHIFT		16
#define NVIC_IPR16_IPR_N2_MASK		0xff
/** @defgroup nvic_ipr16_ipr_n2 IPRN2 IPR_N2
@{*/
/**@}*/


#define NVIC_IPR16_IPR_N1_SHIFT		8
#define NVIC_IPR16_IPR_N1_MASK		0xff
/** @defgroup nvic_ipr16_ipr_n1 IPRN1 IPR_N1
@{*/
/**@}*/


#define NVIC_IPR16_IPR_N0_SHIFT		0
#define NVIC_IPR16_IPR_N0_MASK		0xff
/** @defgroup nvic_ipr16_ipr_n0 IPRN0 IPR_N0
@{*/
/**@}*/


/**@}*/

/** @defgroup nvic_ipr17 IPR17 Interrupt Priority Register
@{*/


#define NVIC_IPR17_IPR_N3_SHIFT		24
#define NVIC_IPR17_IPR_N3_MASK		0xff
/** @defgroup nvic_ipr17_ipr_n3 IPRN3 IPR_N3
@{*/
/**@}*/


#define NVIC_IPR17_IPR_N2_SHIFT		16
#define NVIC_IPR17_IPR_N2_MASK		0xff
/** @defgroup nvic_ipr17_ipr_n2 IPRN2 IPR_N2
@{*/
/**@}*/


#define NVIC_IPR17_IPR_N1_SHIFT		8
#define NVIC_IPR17_IPR_N1_MASK		0xff
/** @defgroup nvic_ipr17_ipr_n1 IPRN1 IPR_N1
@{*/
/**@}*/


#define NVIC_IPR17_IPR_N0_SHIFT		0
#define NVIC_IPR17_IPR_N0_MASK		0xff
/** @defgroup nvic_ipr17_ipr_n0 IPRN0 IPR_N0
@{*/
/**@}*/


/**@}*/

/** @defgroup nvic_ipr18 IPR18 Interrupt Priority Register
@{*/


#define NVIC_IPR18_IPR_N3_SHIFT		24
#define NVIC_IPR18_IPR_N3_MASK		0xff
/** @defgroup nvic_ipr18_ipr_n3 IPRN3 IPR_N3
@{*/
/**@}*/


#define NVIC_IPR18_IPR_N2_SHIFT		16
#define NVIC_IPR18_IPR_N2_MASK		0xff
/** @defgroup nvic_ipr18_ipr_n2 IPRN2 IPR_N2
@{*/
/**@}*/


#define NVIC_IPR18_IPR_N1_SHIFT		8
#define NVIC_IPR18_IPR_N1_MASK		0xff
/** @defgroup nvic_ipr18_ipr_n1 IPRN1 IPR_N1
@{*/
/**@}*/


#define NVIC_IPR18_IPR_N0_SHIFT		0
#define NVIC_IPR18_IPR_N0_MASK		0xff
/** @defgroup nvic_ipr18_ipr_n0 IPRN0 IPR_N0
@{*/
/**@}*/


/**@}*/

/** @defgroup nvic_ipr19 IPR19 Interrupt Priority Register
@{*/


#define NVIC_IPR19_IPR_N3_SHIFT		24
#define NVIC_IPR19_IPR_N3_MASK		0xff
/** @defgroup nvic_ipr19_ipr_n3 IPRN3 IPR_N3
@{*/
/**@}*/


#define NVIC_IPR19_IPR_N2_SHIFT		16
#define NVIC_IPR19_IPR_N2_MASK		0xff
/** @defgroup nvic_ipr19_ipr_n2 IPRN2 IPR_N2
@{*/
/**@}*/


#define NVIC_IPR19_IPR_N1_SHIFT		8
#define NVIC_IPR19_IPR_N1_MASK		0xff
/** @defgroup nvic_ipr19_ipr_n1 IPRN1 IPR_N1
@{*/
/**@}*/


#define NVIC_IPR19_IPR_N0_SHIFT		0
#define NVIC_IPR19_IPR_N0_MASK		0xff
/** @defgroup nvic_ipr19_ipr_n0 IPRN0 IPR_N0
@{*/
/**@}*/


/**@}*/

/** @defgroup nvic_ipr20 IPR20 Interrupt Priority Register
@{*/


#define NVIC_IPR20_IPR_N3_SHIFT		24
#define NVIC_IPR20_IPR_N3_MASK		0xff
/** @defgroup nvic_ipr20_ipr_n3 IPRN3 IPR_N3
@{*/
/**@}*/


#define NVIC_IPR20_IPR_N2_SHIFT		16
#define NVIC_IPR20_IPR_N2_MASK		0xff
/** @defgroup nvic_ipr20_ipr_n2 IPRN2 IPR_N2
@{*/
/**@}*/


#define NVIC_IPR20_IPR_N1_SHIFT		8
#define NVIC_IPR20_IPR_N1_MASK		0xff
/** @defgroup nvic_ipr20_ipr_n1 IPRN1 IPR_N1
@{*/
/**@}*/


#define NVIC_IPR20_IPR_N0_SHIFT		0
#define NVIC_IPR20_IPR_N0_MASK		0xff
/** @defgroup nvic_ipr20_ipr_n0 IPRN0 IPR_N0
@{*/
/**@}*/


/**@}*/

/** @defgroup nvic_ipr21 IPR21 Interrupt Priority Register
@{*/


#define NVIC_IPR21_IPR_N3_SHIFT		24
#define NVIC_IPR21_IPR_N3_MASK		0xff
/** @defgroup nvic_ipr21_ipr_n3 IPRN3 IPR_N3
@{*/
/**@}*/


#define NVIC_IPR21_IPR_N2_SHIFT		16
#define NVIC_IPR21_IPR_N2_MASK		0xff
/** @defgroup nvic_ipr21_ipr_n2 IPRN2 IPR_N2
@{*/
/**@}*/


#define NVIC_IPR21_IPR_N1_SHIFT		8
#define NVIC_IPR21_IPR_N1_MASK		0xff
/** @defgroup nvic_ipr21_ipr_n1 IPRN1 IPR_N1
@{*/
/**@}*/


#define NVIC_IPR21_IPR_N0_SHIFT		0
#define NVIC_IPR21_IPR_N0_MASK		0xff
/** @defgroup nvic_ipr21_ipr_n0 IPRN0 IPR_N0
@{*/
/**@}*/


/**@}*/

/** @defgroup nvic_ipr22 IPR22 Interrupt Priority Register
@{*/


#define NVIC_IPR22_IPR_N3_SHIFT		24
#define NVIC_IPR22_IPR_N3_MASK		0xff
/** @defgroup nvic_ipr22_ipr_n3 IPRN3 IPR_N3
@{*/
/**@}*/


#define NVIC_IPR22_IPR_N2_SHIFT		16
#define NVIC_IPR22_IPR_N2_MASK		0xff
/** @defgroup nvic_ipr22_ipr_n2 IPRN2 IPR_N2
@{*/
/**@}*/


#define NVIC_IPR22_IPR_N1_SHIFT		8
#define NVIC_IPR22_IPR_N1_MASK		0xff
/** @defgroup nvic_ipr22_ipr_n1 IPRN1 IPR_N1
@{*/
/**@}*/


#define NVIC_IPR22_IPR_N0_SHIFT		0
#define NVIC_IPR22_IPR_N0_MASK		0xff
/** @defgroup nvic_ipr22_ipr_n0 IPRN0 IPR_N0
@{*/
/**@}*/


/**@}*/

/** @defgroup nvic_ipr23 IPR23 Interrupt Priority Register
@{*/


#define NVIC_IPR23_IPR_N3_SHIFT		24
#define NVIC_IPR23_IPR_N3_MASK		0xff
/** @defgroup nvic_ipr23_ipr_n3 IPRN3 IPR_N3
@{*/
/**@}*/


#define NVIC_IPR23_IPR_N2_SHIFT		16
#define NVIC_IPR23_IPR_N2_MASK		0xff
/** @defgroup nvic_ipr23_ipr_n2 IPRN2 IPR_N2
@{*/
/**@}*/


#define NVIC_IPR23_IPR_N1_SHIFT		8
#define NVIC_IPR23_IPR_N1_MASK		0xff
/** @defgroup nvic_ipr23_ipr_n1 IPRN1 IPR_N1
@{*/
/**@}*/


#define NVIC_IPR23_IPR_N0_SHIFT		0
#define NVIC_IPR23_IPR_N0_MASK		0xff
/** @defgroup nvic_ipr23_ipr_n0 IPRN0 IPR_N0
@{*/
/**@}*/


/**@}*/

/** @defgroup nvic_ipr24 IPR24 Interrupt Priority Register
@{*/


#define NVIC_IPR24_IPR_N3_SHIFT		24
#define NVIC_IPR24_IPR_N3_MASK		0xff
/** @defgroup nvic_ipr24_ipr_n3 IPRN3 IPR_N3
@{*/
/**@}*/


#define NVIC_IPR24_IPR_N2_SHIFT		16
#define NVIC_IPR24_IPR_N2_MASK		0xff
/** @defgroup nvic_ipr24_ipr_n2 IPRN2 IPR_N2
@{*/
/**@}*/


#define NVIC_IPR24_IPR_N1_SHIFT		8
#define NVIC_IPR24_IPR_N1_MASK		0xff
/** @defgroup nvic_ipr24_ipr_n1 IPRN1 IPR_N1
@{*/
/**@}*/


#define NVIC_IPR24_IPR_N0_SHIFT		0
#define NVIC_IPR24_IPR_N0_MASK		0xff
/** @defgroup nvic_ipr24_ipr_n0 IPRN0 IPR_N0
@{*/
/**@}*/


/**@}*/

/** @defgroup nvic_ipr25 IPR25 Interrupt Priority Register
@{*/


#define NVIC_IPR25_IPR_N3_SHIFT		24
#define NVIC_IPR25_IPR_N3_MASK		0xff
/** @defgroup nvic_ipr25_ipr_n3 IPRN3 IPR_N3
@{*/
/**@}*/


#define NVIC_IPR25_IPR_N2_SHIFT		16
#define NVIC_IPR25_IPR_N2_MASK		0xff
/** @defgroup nvic_ipr25_ipr_n2 IPRN2 IPR_N2
@{*/
/**@}*/


#define NVIC_IPR25_IPR_N1_SHIFT		8
#define NVIC_IPR25_IPR_N1_MASK		0xff
/** @defgroup nvic_ipr25_ipr_n1 IPRN1 IPR_N1
@{*/
/**@}*/


#define NVIC_IPR25_IPR_N0_SHIFT		0
#define NVIC_IPR25_IPR_N0_MASK		0xff
/** @defgroup nvic_ipr25_ipr_n0 IPRN0 IPR_N0
@{*/
/**@}*/


/**@}*/

/** @defgroup nvic_ipr26 IPR26 Interrupt Priority Register
@{*/


#define NVIC_IPR26_IPR_N3_SHIFT		24
#define NVIC_IPR26_IPR_N3_MASK		0xff
/** @defgroup nvic_ipr26_ipr_n3 IPRN3 IPR_N3
@{*/
/**@}*/


#define NVIC_IPR26_IPR_N2_SHIFT		16
#define NVIC_IPR26_IPR_N2_MASK		0xff
/** @defgroup nvic_ipr26_ipr_n2 IPRN2 IPR_N2
@{*/
/**@}*/


#define NVIC_IPR26_IPR_N1_SHIFT		8
#define NVIC_IPR26_IPR_N1_MASK		0xff
/** @defgroup nvic_ipr26_ipr_n1 IPRN1 IPR_N1
@{*/
/**@}*/


#define NVIC_IPR26_IPR_N0_SHIFT		0
#define NVIC_IPR26_IPR_N0_MASK		0xff
/** @defgroup nvic_ipr26_ipr_n0 IPRN0 IPR_N0
@{*/
/**@}*/


/**@}*/

/** @defgroup nvic_ipr27 IPR27 Interrupt Priority Register
@{*/


#define NVIC_IPR27_IPR_N3_SHIFT		24
#define NVIC_IPR27_IPR_N3_MASK		0xff
/** @defgroup nvic_ipr27_ipr_n3 IPRN3 IPR_N3
@{*/
/**@}*/


