grevaillot/svd_tools/headers/STM32H7B3x/nvic.h
#define NVIC_IPR37_IPR_N2_SHIFT		16
#define NVIC_IPR37_IPR_N2_MASK		0xff
/** @defgroup nvic_ipr37_ipr_n2 IPRN2 IPR_N2
@{*/
/**@}*/


#define NVIC_IPR37_IPR_N1_SHIFT		8
#define NVIC_IPR37_IPR_N1_MASK		0xff
/** @defgroup nvic_ipr37_ipr_n1 IPRN1 IPR_N1
@{*/
/**@}*/


#define NVIC_IPR37_IPR_N0_SHIFT		0
#define NVIC_IPR37_IPR_N0_MASK		0xff
/** @defgroup nvic_ipr37_ipr_n0 IPRN0 IPR_N0
@{*/
/**@}*/


/**@}*/

/** @defgroup nvic_ipr38 IPR38 Interrupt Priority Register
@{*/


#define NVIC_IPR38_IPR_N3_SHIFT		24
#define NVIC_IPR38_IPR_N3_MASK		0xff
/** @defgroup nvic_ipr38_ipr_n3 IPRN3 IPR_N3
@{*/
/**@}*/


#define NVIC_IPR38_IPR_N2_SHIFT		16
#define NVIC_IPR38_IPR_N2_MASK		0xff
/** @defgroup nvic_ipr38_ipr_n2 IPRN2 IPR_N2
@{*/
/**@}*/


#define NVIC_IPR38_IPR_N1_SHIFT		8
#define NVIC_IPR38_IPR_N1_MASK		0xff
/** @defgroup nvic_ipr38_ipr_n1 IPRN1 IPR_N1
@{*/
/**@}*/


#define NVIC_IPR38_IPR_N0_SHIFT		0
#define NVIC_IPR38_IPR_N0_MASK		0xff
/** @defgroup nvic_ipr38_ipr_n0 IPRN0 IPR_N0
@{*/
/**@}*/


/**@}*/

/** @defgroup nvic_ipr39 IPR39 Interrupt Priority Register
@{*/


#define NVIC_IPR39_IPR_N3_SHIFT		24
#define NVIC_IPR39_IPR_N3_MASK		0xff
/** @defgroup nvic_ipr39_ipr_n3 IPRN3 IPR_N3
@{*/
/**@}*/


#define NVIC_IPR39_IPR_N2_SHIFT		16
#define NVIC_IPR39_IPR_N2_MASK		0xff
/** @defgroup nvic_ipr39_ipr_n2 IPRN2 IPR_N2
@{*/
/**@}*/


#define NVIC_IPR39_IPR_N1_SHIFT		8
#define NVIC_IPR39_IPR_N1_MASK		0xff
/** @defgroup nvic_ipr39_ipr_n1 IPRN1 IPR_N1
@{*/
/**@}*/


#define NVIC_IPR39_IPR_N0_SHIFT		0
#define NVIC_IPR39_IPR_N0_MASK		0xff
/** @defgroup nvic_ipr39_ipr_n0 IPRN0 IPR_N0
@{*/
/**@}*/


/**@}*/

/** @defgroup nvic_iser3 ISER3 Interrupt Set-Enable Register
@{*/


#define NVIC_ISER3_SETENA_SHIFT		0
#define NVIC_ISER3_SETENA_MASK		0xffffffff
/** @defgroup nvic_iser3_setena SETENA SETENA
@{*/
/**@}*/


/**@}*/

/** @defgroup nvic_iser4 ISER4 Interrupt Set-Enable Register
@{*/


#define NVIC_ISER4_SETENA_SHIFT		0
#define NVIC_ISER4_SETENA_MASK		0xffffffff
/** @defgroup nvic_iser4_setena SETENA SETENA
@{*/
/**@}*/


/**@}*/

/** @defgroup nvic_icer3 ICER3 Interrupt Clear-Enable Register
@{*/


#define NVIC_ICER3_CLRENA_SHIFT		0
#define NVIC_ICER3_CLRENA_MASK		0xffffffff
/** @defgroup nvic_icer3_clrena CLRENA CLRENA
@{*/
/**@}*/


/**@}*/

/** @defgroup nvic_icer4 ICER4 Interrupt Clear-Enable Register
@{*/


#define NVIC_ICER4_CLRENA_SHIFT		0
#define NVIC_ICER4_CLRENA_MASK		0xffffffff
/** @defgroup nvic_icer4_clrena CLRENA CLRENA
@{*/
/**@}*/


/**@}*/

/** @defgroup nvic_ispr3 ISPR3 Interrupt Set-Pending Register
@{*/


#define NVIC_ISPR3_SETPEND_SHIFT		0
#define NVIC_ISPR3_SETPEND_MASK		0xffffffff
/** @defgroup nvic_ispr3_setpend SETPEND SETPEND
@{*/
/**@}*/


/**@}*/

/** @defgroup nvic_ispr4 ISPR4 Interrupt Set-Pending Register
@{*/


#define NVIC_ISPR4_SETPEND_SHIFT		0
#define NVIC_ISPR4_SETPEND_MASK		0xffffffff
/** @defgroup nvic_ispr4_setpend SETPEND SETPEND
@{*/
/**@}*/


/**@}*/

/** @defgroup nvic_iabr3 IABR3 Interrupt Active Bit Register
@{*/


#define NVIC_IABR3_ACTIVE_SHIFT		0
#define NVIC_IABR3_ACTIVE_MASK		0xffffffff
/** @defgroup nvic_iabr3_active ACTIVE ACTIVE
@{*/
/**@}*/


/**@}*/

/** @defgroup nvic_iabr4 IABR4 Interrupt Active Bit Register
@{*/


#define NVIC_IABR4_ACTIVE_SHIFT		0
#define NVIC_IABR4_ACTIVE_MASK		0xffffffff
/** @defgroup nvic_iabr4_active ACTIVE ACTIVE
@{*/
/**@}*/


/**@}*/

/** @defgroup nvic_ipr40 IPR40 Interrupt Priority Register
@{*/


#define NVIC_IPR40_IPR_N3_SHIFT		24
#define NVIC_IPR40_IPR_N3_MASK		0xff
/** @defgroup nvic_ipr40_ipr_n3 IPRN3 IPR_N3
@{*/
/**@}*/


#define NVIC_IPR40_IPR_N2_SHIFT		16
#define NVIC_IPR40_IPR_N2_MASK		0xff
/** @defgroup nvic_ipr40_ipr_n2 IPRN2 IPR_N2
@{*/
/**@}*/


#define NVIC_IPR40_IPR_N1_SHIFT		8
#define NVIC_IPR40_IPR_N1_MASK		0xff
/** @defgroup nvic_ipr40_ipr_n1 IPRN1 IPR_N1
@{*/
/**@}*/


#define NVIC_IPR40_IPR_N0_SHIFT		0
#define NVIC_IPR40_IPR_N0_MASK		0xff
/** @defgroup nvic_ipr40_ipr_n0 IPRN0 IPR_N0
@{*/
/**@}*/


/**@}*/
